//// This file contains an 'Intel Peripheral Driver' and is      // licensed for Intel CPUs and chipsets under the terms of your// license agreement with Intel or your vendor.  This file may // be modified by the user, subject to additional terms of the // license agreement                                           //// *++//// Copyright (c) 1999 - 2015 Intel Corporation. All rights reserved// This software and associated documentation (if any) is furnished// under a license and may only be used or copied in accordance// with the terms of the license. Except as permitted by such// license, no part of this software or documentation may be// reproduced, stored in a retrieval system, or transmitted in any// form or by any means without the express written consent of// Intel Corporation.////// Module Name:////   ProcessorSetupStrings.uni//// Abstract:////   String definitions for Processor Setup formset.//// Revision History://// --*//=##langdef   en-US "English"//// Advanced - Processor Configuration//#string STR_PROCESSOR_CONFIG_FORM_TITLE #language en-US "Processor Configuration"#string STR_PROCESSOR_CONFIG_FORM_HELP  #language en-US "Displays and provides option to change the Processor Settings"#string STR_DFX_PROCESSOR_CONFIG_FORM_TITLE #language en-US "Processor DFX Configuration"#string STR_DFX_PROCESSOR_CONFIG_FORM_HELP  #language en-US "Displays and provides option to change the DFX Processor Settings"#string STR_PROCESSOR_ID_STRING         #language en-US "Processor ID"#string STR_PROCESSOR_ID_VALUE          #language en-US ""#string STR_PROCESSOR2_3_ID_VALUE       #language en-US ""#string STR_PROCESSOR_FREQ_STRING       #language en-US "Processor Frequency"#string STR_PROCESSOR_FREQ_VALUE        #language en-US ""#string STR_PROCESSOR2_3_FREQ_VALUE     #language en-US ""#string STR_PROCESSOR_MICROCODE_STRING  #language en-US "Microcode Revision"#string STR_PROCESSOR_MICROCODE_VALUE   #language en-US ""#string STR_PROCESSOR2_3_MICROCODE_VALUE  #language en-US ""#string STR_PROCESSOR_BCLK_FREQ_STRING  #language en-US "CPU BCLK Frequency"#string STR_PROCESSOR_BCLK_FREQ_VALUE   #language en-US ""#string STR_PROCESSOR2_3_FREQ_VALUE     #language en-US ""#string STR_PROCESSOR_L1_CACHE_STRING   #language en-US "L1 Cache RAM"#string STR_PROCESSOR_L1_CACHE_VALUE    #language en-US ""#string STR_PROCESSOR2_3_L1_CACHE_VALUE #language en-US ""#string STR_PROCESSOR_L2_CACHE_STRING   #language en-US "L2 Cache RAM"#string STR_PROCESSOR_L2_CACHE_VALUE    #language en-US ""#string STR_PROCESSOR2_3_L2_CACHE_VALUE #language en-US ""#string STR_CORE_NUMBER_ALL             #language en-US "All"#string STR_CORE_NUMBER_NONE            #language en-US "None"#string STR_CORE_NUMBER_1               #language en-US "1"#string STR_CORE_NUMBER_2               #language en-US "2"#string STR_CORE_NUMBER_3               #language en-US "3"#string STR_CORE_NUMBER_4               #language en-US "4"#string STR_CORE_NUMBER_5               #language en-US "5"#string STR_CORE_NUMBER_6               #language en-US "6"#string STR_CORE_NUMBER_7               #language en-US "7"#string STR_CORE_NUMBER_8               #language en-US "8"#string STR_CORE_NUMBER_9               #language en-US "9"#string STR_CORE_NUMBER_10              #language en-US "10"#string STR_CORE_NUMBER_11              #language en-US "11"#string STR_CORE_NUMBER_12              #language en-US "12"#string STR_CORE_NUMBER_13              #language en-US "13"#string STR_CORE_NUMBER_14              #language en-US "14"#string STR_CORE_NUMBER_15              #language en-US "15"#string STR_CORE_NUMBER_16              #language en-US "16"#string STR_SYSTEM_MEMORY_SPEED_STRING  #language en-US "System Memory Speed"#string STR_SYSTEM_MEMORY_SPEED_VALUE   #language en-US ""#string STR_SYSTEM_VMSE_SPEED_STRING  #language en-US "System SMI2 Speed"#string STR_SYSTEM_VMSE_SPEED_VALUE   #language en-US ""#string STR_ZERO                        #language en-US "0"#string STR_64K                         #language en-US "64K"#string STR_128K                        #language en-US "128K"#string STR_256K                        #language en-US "256K"#string STR_512K                        #language en-US "512K"#string STR_1024K                       #language en-US "1024K"#string STR_2048K                       #language en-US "2048K"#string STR_4096K                       #language en-US "4096K"#string STR_4M                          #language en-US "4M"#string STR_8M                          #language en-US "8M"#string STR_16M                         #language en-US "16M"#string STR_32M                         #language en-US "32M"#string STR_64M                         #language en-US "64M"#string STR_128M                        #language en-US "128M"#string STR_256M                        #language en-US "256M"#string STR_512M                        #language en-US "512M"#string STR_1G                          #language en-US "1G"#string STR_2G                          #language en-US "2G"#string STR_4G                          #language en-US "4G"#string STR_2MS                         #language en-US "2ms"#string STR_4MS                         #language en-US "4ms"#string STR_8MS                         #language en-US "8ms"#string STR_16MS                        #language en-US "16ms"#string STR_PROCESSOR_IED_PROMPT        #language en-US "Intel Enhanced Debug"#string STR_PROCESSOR_IED_HELP          #language en-US "Option to disable/enable Intel Enhanced Debug support"#string STR_PROCESSOR_CORE_RATIO        #language en-US "CPU Core Ratio"#string STR_PROCESSOR_CORE_RATIO_HELP   #language en-US "Non-Turbo Mode Processor Core Ratio Multiplier"#string STR_PROCESSOR_VMX               #language en-US "VMX"#string STR_PROCESSOR_VMX_HELP          #language en-US "Enables the Vanderpool Technology, takes effect after reboot."#string STR_LT                          #language en-US "Enable SMX"#string STR_LT_HELP                     #language en-US "Enables Safer Mode Extensions."// Denverton AptioV Override EIP# 408897: Implement PPIN support on Denverton platform - Start#string STR_PPIN_CONTROL_PROMPT         #language en-US "PPIN Control"#string STR_PPIN_CONTROL_HELP           #language en-US "Unlock and Enable/Disable PPIN Control"#string STR_UNLOCK_ENABLE               #language en-US "Unlock/Enable"#string STR_UNLOCK_DISABLE              #language en-US "Unlock/Disable"// Denverton AptioV Override EIP# 408897: Implement PPIN support on Denverton platform - End#string STR_PROCESSOR_C1E               #language en-US "Enhanced Halt State (C1E)"#string STR_PROCESSOR_C1E_HELP          #language en-US "Enables the Enhanced C1E state of the CPU, takes effect after reboot."#string STR_PROCESSOR_EIST              #language en-US "EIST (GV3)"#string STR_PROCESSOR_EIST_HELP         #language en-US "Enable/Disable EIST. GV3 and TM1 must be enabled for TM2 to be available. GV3 must be enabled for Turbo. Auto - Enable for B0 CPU stepping, all others disabled, change setting to override."#string STR_NUMLOCK_PROMPT              #language en-US "Numlock"#string STR_NUMLOCK_HELP                #language en-US "Turns keyboard numlock on or off"#string STR_LIMIT_CPUID_PROMPT          #language en-US "Max CPUID Value Limit"#string STR_LIMIT_CPUID_HELP            #language en-US "This should be enabled in order to boot legacy OSes that cannot support CPUs with extended CPUID functions."#string STR_EXECUTE_DISABLE_BIT_PROMPT  #language en-US "Execute Disable Bit"#string STR_EXECUTE_DISABLE_BIT_HELP    #language en-US "When disabled, forces the XD feature flag to always return 0."#string STR_MWAIT                       #language en-US "Monitor/Mwait"#string STR_MWAIT_HELP                  #language en-US "Enable or Disable the Monitor/Mwait instruction"#string STR_MAX_C_STATE                 #language en-US "Max Core C-State"#string STR_MAX_C_STATE_HELP            #language en-US "Options are: C1 and C6."#string STR_C1                          #language en-US "C1"#string STR_C6                          #language en-US "C6"#string STR_L1_PREFETCHER               #language en-US "L1 Prefetcher" #string STR_L1_PREFETCHER_HELP          #language en-US "Enable/Disable L1 Prefetch"#string STR_L2_PREFETCHER               #language en-US "L2 Prefetcher"#string STR_L2_PREFETCHER_HELP          #language en-US "Enable/Disable L2 Prefetch"#string STR_FAST_STR                    #language en-US "Fast String"#string STR_FAST_STR_HELP               #language en-US "When enabled, enable fast strings for REP MOVS/STOS"#string STR_MCH_STR                     #language en-US "Machine Check"#string STR_MCH_STR_HELP                #language en-US "Enable or Disable the Machine Check"#string STR_PROCESSOR_TURBO_MODE        #language en-US "Turbo"#string STR_PROCESSOR_TURBO_MODE_HELP   #language en-US "Enable or Disable CPU Turbo capability. This option only applies to ES2 and above."#string STR_PROCESSOR_RAPL              #language en-US "RAPL"#string STR_PROCESSOR_RAPL_HELP         #language en-US "Enable or Disable CPU RAPL capability. This option only applies to ES2 and above."#string STR_PROCESSOR_I_TURBO_MODE      #language en-US "Energy Performance Bias"#string STR_PROCESSOR_I_TURBO_MODE_HELP #language en-US "Selects the energy efficiency policies used in making turbo decision by the CPU. The energy policy controls turbo performance vs. power."#string STR_PERFORMANCE                 #language en-US "Performance"#string STR_BALANCED_PERFORMANCE        #language en-US "Balanced Performance"#string STR_BALANCED_EFFICIENCY         #language en-US "Balanced Efficiency"#string STR_ENERGY_EFFICIENT            #language en-US "Energy Efficient"#string STR_PROCESSOR_XAPIC             #language en-US "Extended APIC"#string STR_PROCESSOR_XAPIC_HELP        #language en-US "Enable/disable extended APIC support"#string STR_PROCESSOR_AES               #language en-US "AES-NI"#string STR_PROCESSOR_AES_HELP          #language en-US "Enable/disable AES-NI support"#string STR_PROCESSOR_VERSION_STRING  #language en-US "Processor Version"#string STR_PROCESSOR_VERSION_VALUE   #language en-US "Not Present"#string STR_PROCESSOR_VERSION_SOCKET0_VALUE2  #language en-US ""#string STR_PACKAGE_CSTATE_REPORT       #language en-US "Package C State limit"#string STR_PACKAGE_CSTATE_REPORT_HELP  #language en-US "Package C State limit"#string STR_NOPACKAGE_CSTATE            #language en-US "No Pkg C-State"#string STR_NOS0IX                      #language en-US "No S0Ix"#string STR_C0SUPPORT                   #language en-US "C0/C1 state"#string STR_C1SUPPORT                   #language en-US "C1 state"#string STR_C2SUPPORT                   #language en-US "C2 state"#string STR_C3SUPPORT                   #language en-US "C3 state"#string STR_C4SUPPORT                   #language en-US "C4 state"#string STR_C6SUPPORT                   #language en-US "C6(non Retention) state"#string STR_C6_RETSUPPORT               #language en-US "C6(Retention) state"#string STR_C7SUPPORT                   #language en-US "C7 state"#string STR_C7SSUPPORT                  #language en-US "C7s state"#string STR_CSUPPORT_HELP               #language en-US "Package C State limit"#string STR_NOLIMIT                     #language en-US "No Limit"#string STR_NOLIMIT_HELP                #language en-US "No Package C State limit"#string STR_C2_ENABLE                   #language en-US "ACPI C2"#string STR_C2_ENABLE_HELP              #language en-US "Configure CPU (ACPI C2) reported to OS, C6 No Shrink or C6 Full Shrink"#string STR_C6_NS                       #language en-US "C6 NS"#string STR_C6_FS                       #language en-US "C6 FS"#string STR_C6_ENABLE                   #language en-US "CPU C6 report"#string STR_C6_ENABLE_HELP              #language en-US "Enable/Disable CPU C6(ACPI C3) report to OS"#string STR_PROCESSOR_CCX               #language en-US "CPU C State"#string STR_PROCESSOR_CCX_HELP          #language en-US "Enables the Enhanced Cx state of the CPU, takes effect after reboot. Auto - Enable for B0 CPU stepping, all others disabled, change setting to override."#string STR_DYNAMIC_SELF_REFRESH_PROMPT #language en-US "Dynamic Self Refresh"#string STR_DYNAMIC_SELF_REFRESH_HELP   #language en-US "Enable/Disable dynamic self refresh in memory controller"#string STR_SELF_REFRESH_DELAY_PROMPT   #language en-US "Self Refresh Delay"#string STR_SELF_REFRESH_DELAY_HELP     #language en-US "Configures self refresh delay in microseconds. DDR-1600 up to 1300us, DDR-1867 up to 1100us, DDR-2133 up to 950us, DDR-2400 up to 850us, DDR-2666 up to 750us."#string STR_DYNAMIC_POWER_MODE_OPCODE_PROMPT #language en-US "PMOP Levels"#string STR_DYNAMIC_POWER_MODE_OPCODE_HELP   #language en-US "Power Mode Opcode during Self Refresh Slow/Fast"#string STR_SLOW_EXIT_STRING                 #language en-US "Slow"#string STR_FAST_EXIT_STRING                 #language en-US "Fast"#string STR_PROCESSOR_BIST              #language en-US "BIST Selection"#string STR_PROCESSOR_BIST_HELP         #language en-US "Enables BIST, takes effect after reboot."#string STR_TM1_PROMPT                  #language en-US "TM1"#string STR_TM1_PROMPT_HELP             #language en-US "Enable/Disable TM1.  TM1 and GV3 must be enabled in order to support TM2"#string STR_TM2_THROTTLE_TYPE_PROMPT             #language en-US "TM2 Mode"#string STR_TM2_THROTTLE_TYPE_PROMPT_HELP        #language en-US "Select LFM throttling or adaptive throttling for TM2 mechanisms."#string STR_LFM_THROTTLING                       #language en-US "LFM Throttling"#string STR_ADAPTIVE_THROTTLING                  #language en-US "Adaptive Throttling"#string STR_HARDWARE_RESOLUTION         #language en-US "Hardware"#string STR_PACKAGE_RESOLUTION          #language en-US "Package"#string STR_MODULE_RESOLUTION           #language en-US "Module"#string STR_ACTIVE_CORE_COUNT_PROMPT             #language en-US "Active Processor Cores"#string STR_ACTIVE_CORE_COUNT_PROMPT_HELP        #language en-US "Set the number of Active Processor Cores in the SoC. A 0 indicates all Existing Processor Cores are Active."#string STR_ACTIVE_CORE_COUNT_ERROR              #language en-US "Value exceeds the number of exisitng cores in the SoC." #string STR_ACTIVE_CORE_COUNT_PROMPT1            #language en-US "CPU1 Active Cores"#string STR_ACTIVE_CORE_COUNT_PROMPT_HELP1       #language en-US "Number of cores to enable in CPU1 processor package." #string STR_ACTIVE_CORE_COUNT_PROMPT2            #language en-US "CPU2 Active Cores"#string STR_ACTIVE_CORE_COUNT_PROMPT_HELP2       #language en-US "Number of cores to enable in CPU2 processor package." #string STR_ACTIVE_CORE_COUNT_PROMPT3            #language en-US "CPU3 Active Cores"#string STR_ACTIVE_CORE_COUNT_PROMPT_HELP3       #language en-US "Number of cores to enable in CPU3 processor package." #string STR_CRASH_DUMP_PROMPT                    #language en-US "Dump Crash Log"#string STR_CRASH_DUMP_PROMPT_HELP               #language en-US "Enable Dump Crash Log"#string STR_ACPI_TSTATES_ENABLE                       #language en-US "ACPI 3.0 T-States"#string STR_ACPI_TSTATES_ENABLE_HELP                  #language en-US "Enable/Disable ACPI 3.0 T-States."#string STR_TT_DUTY_CYCLE               #language en-US "T-State Throttle "#string STR_TT_DUTY_CYCLE_HELP          #language en-US "On-Die Thermal Throttling"#string STR_TT_DUTY_CYCLE_0             #language en-US "default"#string STR_TT_DUTY_CYCLE_1             #language en-US "12.5%"#string STR_TT_DUTY_CYCLE_2             #language en-US "25.0%"#string STR_TT_DUTY_CYCLE_3             #language en-US "37.5%"#string STR_TT_DUTY_CYCLE_4             #language en-US "50.0%"#string STR_TT_DUTY_CYCLE_5             #language en-US "62.5%"#string STR_TT_DUTY_CYCLE_6             #language en-US "75.0%"#string STR_TT_DUTY_CYCLE_7             #language en-US "87.5%"#string STR_PROCESSOR_RATIO_OVERRIDE            #language en-US "CPU Flex Ratio Override"#string STR_PROCESSOR_RATIO_OVERRIDE_HELP       #language en-US "Enable/Disable CPU Flex Ratio Programming"#string STR_PKG_POWER_SKU_UNIT                  #language en-US "MSR 606 PKG_POWER_SKU_UNIT"#string STR_PKG_POWER_SKU_UNIT_HELP             #language en-US "Defines SKU specific units used for power, energy and time"#string STR_PKG_RAPL_TIME_WINDOW1               #language en-US "PL1 Time Window"#string STR_PKG_RAPL_TIME_WINDOW1_HELP          #language en-US "Defines RAPL time window 1 in miliseconds"#string STR_PKG_RAPL_POWER_LIMIT1               #language en-US "PL1 Power Level"#string STR_PKG_RAPL_POWER_LIMIT1_HELP          #language en-US "Defines RAPL power limit 1 in Watts"#string STR_PKG_RAPL_POWER_LIMIT2               #language en-US "PL2 Power Level"#string STR_PKG_RAPL_POWER_LIMIT2_HELP          #language en-US "Defines RAPL power limit 2 in Watts"#string STR_PKG_RAPL_LIMIT_LOCK                 #language en-US "Lock PACKAGE_RAPL_LIMIT"#string STR_PKG_RAPL_LIMIT_LOCK_HELP            #language en-US "Allows the user to lock the MSR 0x610 (PACKAGE_RAPL_LIMIT) by setting the lock bit"#string STR_PL3_CONTROL_PMAX_POWER              #language en-US "PMAX Power"#string STR_PL3_CONTROL_PMAX_POWER_HELP         #language en-US "The SOC guarantees it will never exceed this power limit even for very short time windows"#string STR_PL3_CONTROL_PL3_DUTY_CYCLE          #language en-US "PL3 Duty Cycle Percentage"#string STR_PL3_CONTROL_PL3_DUTY_CYCLE_HELP     #language en-US "Power limit excursion duty cycle control for PL3, describing what percentage of time it is allowed for the SOC to exceed the programmed PL3 power limit. This is expressed as a percentage"#string STR_PL3_CONTROL_TIME_WINDOW             #language en-US "PL3 Time Window"#string STR_PL3_CONTROL_TIME_WINDOW_HELP        #language en-US "Defines RAPL time window 3 in miliseconds"#string STR_PL3_CONTROL_PL3_ENABLE              #language en-US "PL3 Enable"#string STR_PL3_CONTROL_PL3_ENABLE_HELP         #language en-US "Enable/Disable PL3 Algorithm"#string STR_PL3_CONTROL_POWER_LIMIT             #language en-US "PL3 Power Level"#string STR_PL3_CONTROL_POWER_LIMIT_HELP        #language en-US "Defines RAPL power limit 3 in Watts"#string STR_PL3_CONTROL_LOCK                    #language en-US "Lock PL3_CONTROL"#string STR_PL3_CONTROL_LOCK_HELP               #language en-US "Allows the user to lock the MSR 0x615 (PACKAGE_RAPL_LIMIT) by setting the lock bit"#string STR_BIOS_REQUEST_FREQ                   #language en-US "BIOS Request Frequency"#string STR_BIOS_REQUEST_FREQ_HELP              #language en-US "Two modes: Min Frequency and Max Frequency (The CPU will be instructed to provide the highest possible legal frequency to the processor)"#string STR_PROC_TRACE_ENABLE_PROMPT            #language en-US "Processor trace"#string STR_PROC_TRACE_ENABLE_HELP              #language en-US "Enable/Disable processor trace feature from CPU MSR."#string STR_PROC_TRACE_DESTINATION_PROMPT       #language en-US "Processor trace Destination"#string STR_PROC_TRACE_DESTINATION_HELP         #language en-US "Specifies the trace destination either to Memory or TraceHub"#string STR_DEST_TRACE_HUB                      #language en-US "TraceHub"#string STR_DEST_MEMORY                         #language en-US "Memory"#string STR_PROC_TRACE_OUTPUT_SCHEME_PROMPT     #language en-US "Processor Trace OutPut Scheme"#string STR_PROC_TRACE_OUTPUT_SCHEME_HELP       #language en-US "Select Single Range Output scheme or ToPA table Output scheme"#string STR_SINGLE_RANGE_OUTPUT                 #language en-US "Single Range Output"#string STR_TOPA_OUTPUT                         #language en-US "ToPA Output"#string STR_RTIT_4KB                            #language en-US "4KB"#string STR_RTIT_8KB                            #language en-US "8KB"#string STR_RTIT_16KB                           #language en-US "16KB"#string STR_RTIT_32KB                           #language en-US "32KB"#string STR_RTIT_64KB                           #language en-US "64KB"#string STR_RTIT_128KB                          #language en-US "128KB"#string STR_RTIT_256KB                          #language en-US "256KB"#string STR_RTIT_512KB                          #language en-US "512KB"#string STR_RTIT_1MB                            #language en-US "1MB"#string STR_RTIT_2MB                            #language en-US "2MB"#string STR_RTIT_4MB                            #language en-US "4MB"#string STR_RTIT_8MB                            #language en-US "8MB"#string STR_RTIT_16MB                           #language en-US "16MB"#string STR_RTIT_32MB                           #language en-US "32MB"#string STR_RTIT_64MB                           #language en-US "64MB"#string STR_RTIT_128MB                          #language en-US "128MB"#string STR_PROC_TRACE_MEM_SIZE_PROMPT          #language en-US "Processor trace memory allocation"#string STR_PROC_TRACE_MEM_SIZE_HELP            #language en-US "Disable or Select Processor trace memory region Size: from 4KB ~ 128MB"#string STR_RATIO_LIMITS_ENABLE                 #language en-US "Ratio Limits"#string STR_RATIO_LIMITS_ENABLE_HELP            #language en-US "Enable/Disable the configuration of the ratio limits MSRs"#string STR_RATIO_LIMITS_PROMPT                 #language en-US "Ratio Limits Configuration"#string STR_RATIO_LIMITS_PROMPT_HELP            #language en-US "Configure the ratio limits MSRs"#string STR_RATIO_LIMIT_0                       #language en-US "Ratio Limit 0"#string STR_RATIO_LIMIT_0_HELP                  #language en-US "The frequency limit corresponding to the maximum number of active cores specified in CORE_COUNT_0 in FREQ_LIMIT_CORES."#string STR_RATIO_LIMIT_1                       #language en-US "Ratio Limit 1"#string STR_RATIO_LIMIT_1_HELP                  #language en-US "The frequency limit corresponding to the maximum number of active cores specified in CORE_COUNT_1 in FREQ_LIMIT_CORES."#string STR_RATIO_LIMIT_2                       #language en-US "Ratio Limit 2"#string STR_RATIO_LIMIT_2_HELP                  #language en-US "The frequency limit corresponding to the maximum number of active cores specified in CORE_COUNT_2 in FREQ_LIMIT_CORES."#string STR_RATIO_LIMIT_3                       #language en-US "Ratio Limit 3"#string STR_RATIO_LIMIT_3_HELP                  #language en-US "The frequency limit corresponding to the maximum number of active cores specified in CORE_COUNT_3 in FREQ_LIMIT_CORES."#string STR_RATIO_LIMIT_4                       #language en-US "Ratio Limit 4"#string STR_RATIO_LIMIT_4_HELP                  #language en-US "The frequency limit corresponding to the maximum number of active cores specified in CORE_COUNT_4 in FREQ_LIMIT_CORES."#string STR_RATIO_LIMIT_5                       #language en-US "Ratio Limit 5"#string STR_RATIO_LIMIT_5_HELP                  #language en-US "The frequency limit corresponding to the maximum number of active cores specified in CORE_COUNT_5 in FREQ_LIMIT_CORES."#string STR_RATIO_LIMIT_6                       #language en-US "Ratio Limit 6"#string STR_RATIO_LIMIT_6_HELP                  #language en-US "The frequency limit corresponding to the maximum number of active cores specified in CORE_COUNT_6 in FREQ_LIMIT_CORES."#string STR_RATIO_LIMIT_7                       #language en-US "Ratio Limit 7"#string STR_RATIO_LIMIT_7_HELP                  #language en-US "The frequency limit corresponding to the maximum number of active cores specified in CORE_COUNT_7 in FREQ_LIMIT_CORES."#string STR_CORE_COUNT_0                        #language en-US "Core Count 0"#string STR_CORE_COUNT_0_HELP                   #language en-US "The number of maximum active cores corresponding to the frequency limit specified in RATIO_LIMIT_0 in FREQ_LIMIT_RATIOS."#string STR_CORE_COUNT_1                        #language en-US "Core Count 1"#string STR_CORE_COUNT_1_HELP                   #language en-US "The number of maximum active cores corresponding to the frequency limit specified in RATIO_LIMIT_1 in FREQ_LIMIT_RATIOS."#string STR_CORE_COUNT_2                        #language en-US "Core Count 2"#string STR_CORE_COUNT_2_HELP                   #language en-US "The number of maximum active cores corresponding to the frequency limit specified in RATIO_LIMIT_2 in FREQ_LIMIT_RATIOS."#string STR_CORE_COUNT_3                        #language en-US "Core Count 3"#string STR_CORE_COUNT_3_HELP                   #language en-US "The number of maximum active cores corresponding to the frequency limit specified in RATIO_LIMIT_3 in FREQ_LIMIT_RATIOS."#string STR_CORE_COUNT_4                        #language en-US "Core Count 4"#string STR_CORE_COUNT_4_HELP                   #language en-US "The number of maximum active cores corresponding to the frequency limit specified in RATIO_LIMIT_4 in FREQ_LIMIT_RATIOS."#string STR_CORE_COUNT_5                        #language en-US "Core Count 5"#string STR_CORE_COUNT_5_HELP                   #language en-US "The number of maximum active cores corresponding to the frequency limit specified in RATIO_LIMIT_5 in FREQ_LIMIT_RATIOS."#string STR_CORE_COUNT_6                        #language en-US "Core Count 6"#string STR_CORE_COUNT_6_HELP                   #language en-US "The number of maximum active cores corresponding to the frequency limit specified in RATIO_LIMIT_6 in FREQ_LIMIT_RATIOS."#string STR_CORE_COUNT_7                        #language en-US "Core Count 7"#string STR_CORE_COUNT_7_HELP                   #language en-US "The number of maximum active cores corresponding to the frequency limit specified in RATIO_LIMIT_7 in FREQ_LIMIT_RATIOS."//// End of file//